---
kind: property
id: P:Autodesk.Revit.DB.Document.TypeOfStorage(Autodesk.Revit.DB.BuiltInParameter)
zh: 文档、文件
source: html/895089ae-ad3f-200e-fa73-36979efd9ac8.htm
---
# Autodesk.Revit.DB.Document.TypeOfStorage Property

**中文**: 文档、文件

Get the storage type of the specified BuiltInParameter.

## Syntax (C#)
```csharp
public StorageType this[
	BuiltInParameter A_0
] { get; }
```

## Parameters
- **A_0** (`Autodesk.Revit.DB.BuiltInParameter`)